## Chapter 7
#### 7.1 : Handling Missing Data
#### 7.2 : Data Transformation
#### 7.3 : String Manipulation

### 7.1 : Handling Missing Data

- Filtering Out Missing Data
> 1. isnull
> 2. notnull
> 3. dropna
- Filling In Missing Data
> 1. fillna

In [1]:
import pandas as pd
import numpy as np

In [ ]:
#Filtering Out Missing Data:

In [2]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, None])

In [3]:
string_data.isnull()

0    False
1    False
2     True
3     True
dtype: bool

In [4]:
string_data[string_data.isnull()]

2     NaN
3    None
dtype: object

In [5]:
string_data

0     aardvark
1    artichoke
2          NaN
3         None
dtype: object

In [6]:
string_data.notnull()

0     True
1     True
2    False
3    False
dtype: bool

In [7]:
string_data[string_data.notnull()]

0     aardvark
1    artichoke
dtype: object

In [8]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])

In [9]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [12]:
data.dropna(inplace=True)

In [13]:
data

0    1.0
2    3.5
4    7.0
dtype: float64

In [14]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],[np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])

In [19]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [17]:
data.dropna(axis=1,how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [ ]:
#Filling In Missing Data

In [20]:
df = pd.DataFrame(np.random.randn(7, 3))

In [21]:
df

          0         1         2
0 -0.132054 -0.120472  1.082513
1 -1.337014  0.215991 -0.526099
2 -0.459297 -0.367112  2.056153
3  1.145800  0.492514  1.041704
4  0.192573 -0.278636  1.092140
5  0.324200 -0.010530  0.005114
6 -0.012376  0.040742  0.520953

In [22]:
df.iloc[:4, 1] = np.nan

In [23]:
df

          0         1         2
0 -0.132054       NaN  1.082513
1 -1.337014       NaN -0.526099
2 -0.459297       NaN  2.056153
3  1.145800       NaN  1.041704
4  0.192573 -0.278636  1.092140
5  0.324200 -0.010530  0.005114
6 -0.012376  0.040742  0.520953

In [24]:
df.iloc[:2, 2] = np.nan

In [25]:
df

          0         1         2
0 -0.132054       NaN       NaN
1 -1.337014       NaN       NaN
2 -0.459297       NaN  2.056153
3  1.145800       NaN  1.041704
4  0.192573 -0.278636  1.092140
5  0.324200 -0.010530  0.005114
6 -0.012376  0.040742  0.520953

In [28]:
df.fillna(0)

          0         1         2
0 -0.132054  0.000000  0.000000
1 -1.337014  0.000000  0.000000
2 -0.459297  0.000000  2.056153
3  1.145800  0.000000  1.041704
4  0.192573 -0.278636  1.092140
5  0.324200 -0.010530  0.005114
6 -0.012376  0.040742  0.520953

In [29]:
df

          0         1         2
0 -0.132054       NaN       NaN
1 -1.337014       NaN       NaN
2 -0.459297       NaN  2.056153
3  1.145800       NaN  1.041704
4  0.192573 -0.278636  1.092140
5  0.324200 -0.010530  0.005114
6 -0.012376  0.040742  0.520953

In [27]:
df.fillna({1:0.5,2:0.7})

          0         1         2
0 -0.132054  0.500000  0.700000
1 -1.337014  0.500000  0.700000
2 -0.459297  0.500000  2.056153
3  1.145800  0.500000  1.041704
4  0.192573 -0.278636  1.092140
5  0.324200 -0.010530  0.005114
6 -0.012376  0.040742  0.520953


### 7.2 : Data Transformation

- Removing Duplicated
> 1. duplicated
> 2. drop_duplicated
- Transforming Data Using a Function or Mapping
> 1. map
- Replacing Values
> 1. replace
- Renaming Axis Indexes
> 1. rename
- Discretization And Binning
> 1. cut
- Detecting And Filtering Outliers

In [ ]:
# Removing Duplicated

In [30]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'],'k2': [1, 1, 2, 3, 3, 4, 4]})

In [31]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [32]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [33]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [34]:
data['v1'] = range(7)

In [35]:
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [36]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [37]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [ ]:
#Transforming Data Using A Function Or Mapping

In [38]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon','Pastrami', 'corned beef', 'Bacon','pastrami', 'honey ham', 'nova lox'],'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [39]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [40]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [41]:
lowercased = data['food'].str.lower()

In [42]:
data['animal'] = lowercased.map(meat_to_animal)

In [45]:
data["foo"]=data['food'].map(lambda x: meat_to_animal[x.lower()])

In [46]:
data

          food  ounces  animal     foo
0        bacon     4.0     pig     pig
1  pulled pork     3.0     pig     pig
2        bacon    12.0     pig     pig
3     Pastrami     6.0     cow     cow
4  corned beef     7.5     cow     cow
5        Bacon     8.0     pig     pig
6     pastrami     3.0     cow     cow
7    honey ham     5.0     pig     pig
8     nova lox     6.0  salmon  salmon

In [ ]:
#Replacing Values

In [47]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [48]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [49]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [50]:
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [51]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [ ]:
#Discretization and Binning

In [52]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [53]:
bins = [18, 25, 35, 60, 100]

In [54]:
cats = pd.cut(ages, bins)

In [55]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [56]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [57]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [58]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [ ]:
#Detecting and Filtering Outliers

In [59]:
data = pd.DataFrame(np.random.randn(1000, 4))

In [60]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033386    -0.015005     0.038732    -0.020515
std       0.994485     0.973044     1.032418     1.003823
min      -3.587974    -3.039178    -3.270297    -3.243157
25%      -0.680938    -0.699795    -0.673044    -0.714480
50%      -0.083303    -0.039132     0.004474    -0.008228
75%       0.654705     0.643981     0.742928     0.680875
max       3.594064     2.938440     3.763271     3.140271

In [61]:
col = data[2]

In [62]:
col[np.abs(col) > 3]

121   -3.010898
221   -3.131894
265    3.006356
564    3.763271
856   -3.270297
Name: 2, dtype: float64

In [63]:
data[(np.abs(data) > 3).any(1)]

            0         1         2         3
22   3.594064  0.307742  0.005578 -1.193885
56  -0.722951 -3.039178 -0.660286  0.314721
121  1.061727  0.088075 -3.010898  0.463797
199 -3.587974 -1.627693  0.053081  0.510878
221  0.695626  1.458953 -3.131894  0.398588
263  0.076227  0.617912  0.103864  3.140271
265 -0.145148  0.175783  3.006356 -1.838467
382  0.838521  0.866541  0.871025  3.128662
564  0.480295  0.348430  3.763271  1.768503
722  3.105242 -0.779538 -0.094329 -2.003475
810 -0.396841 -1.323981  2.310327 -3.243157
856 -0.432373 -0.442592 -3.270297 -1.050161
995 -0.258450  0.276642  1.760693 -3.017554

In [64]:
data[np.abs(data) > 3] = np.sign(data) * 3

In [65]:
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.033497    -0.014966     0.038375    -0.020523
std       0.990228     0.972923     1.028658     1.002189
min      -3.000000    -3.000000    -3.000000    -3.000000
25%      -0.680938    -0.699795    -0.673044    -0.714480
50%      -0.083303    -0.039132     0.004474    -0.008228
75%       0.654705     0.643981     0.742928     0.680875
max       3.000000     2.938440     3.000000     3.000000



### 7.3 : String Manipulation

- Regular Expressions
> 1. regex

In [ ]:
#Regular Expressions

In [66]:
import re
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""
pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

In [67]:
# re.IGNORECASE makes the regex case-insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [68]:
regex

re.compile(r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}', re.IGNORECASE|re.UNICODE)

In [69]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']